All-4-Test-Suites-Excel-Reports/Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained peak load"
  plugins:
    expect: {}

scenarios:
  - name: "API User Flow"
    flow:
      - get:
          url: "/api/status"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "Password123!"
          expect:
            - statusCode: 200
          capture:
            - json: "$.token"
              as: "jwtToken"
